guard-platform-CE/aaa/identity_provider/bootstrap/template/update-application-google.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:xsd="http://org.apache.axis2/xsd" xmlns:xsd1="http://model.common.application.identity.carbon.wso2.org/xsd">
   <soapenv:Header/>
   <soapenv:Body>
      <xsd:updateApplication>
         <xsd:serviceProvider>
            <xsd1:applicationID>${SP_ID}</xsd1:applicationID>
            <xsd1:applicationName>${SP_NAME}</xsd1:applicationName>
            <xsd1:description>Service provider for ${SP_NAME} Web Application</xsd1:description>
            <xsd1:claimConfig>
                <xsd1:alwaysSendMappedLocalSubjectId>false</xsd1:alwaysSendMappedLocalSubjectId>
                <xsd1:localClaimDialect>true</xsd1:localClaimDialect>
            </xsd1:claimConfig>
            <xsd1:inboundAuthenticationConfig>
                <xsd1:inboundAuthenticationRequestConfigs>
                    <xsd1:inboundAuthKey>${OAUTH_KEY}</xsd1:inboundAuthKey>
                    <xsd1:inboundAuthType>oauth2</xsd1:inboundAuthType>
                    <xsd1:properties>
                        <xsd1:name>oauthConsumerSecret</xsd1:name>
                        <xsd1:value>${OAUTH_SECRET}</xsd1:value>
                    </xsd1:properties>
                </xsd1:inboundAuthenticationRequestConfigs>
            </xsd1:inboundAuthenticationConfig>
            <xsd1:inboundProvisioningConfig>
                <xsd1:provisioningEnabled>false</xsd1:provisioningEnabled>
                <xsd1:provisioningUserStore>PRIMARY</xsd1:provisioningUserStore>
            </xsd1:inboundProvisioningConfig>
            <xsd1:localAndOutBoundAuthenticationConfig>
                <xsd1:authenticationSteps>
                    <xsd1:federatedIdentityProviders>
                        <xsd1:federatedAuthenticatorConfigs>
                            <xsd1:displayName>Google</xsd1:displayName>
                            <xsd1:name>GoogleOIDCAuthenticator</xsd1:name>
                            <xsd1:valid>true</xsd1:valid>
                        </xsd1:federatedAuthenticatorConfigs>
                        <xsd1:identityProviderName>${IDP_NAME}</xsd1:identityProviderName>
                    </xsd1:federatedIdentityProviders>
                    <xsd1:stepOrder>1</xsd1:stepOrder>
                    <xsd1:subjectStep>false</xsd1:subjectStep>
                </xsd1:authenticationSteps>
                <xsd1:authenticationType>federated</xsd1:authenticationType>
                <xsd1:subjectClaimUri>http://wso2.org/claims/email</xsd1:subjectClaimUri>
            </xsd1:localAndOutBoundAuthenticationConfig>
            <xsd1:outboundProvisioningConfig>
                <xsd1:provisionByRoleList></xsd1:provisionByRoleList>
            </xsd1:outboundProvisioningConfig>
            <xsd1:permissionAndRoleConfig></xsd1:permissionAndRoleConfig>
            <xsd1:saasApp>false</xsd1:saasApp>
         </xsd:serviceProvider>
      </xsd:updateApplication>
   </soapenv:Body>
</soapenv:Envelope>
